

print('Bem-vindo a loja de Gelados do João Silva!')

print('-------------------------Cardápio-------------------------')
print('----------------------------------------------------------')
print('---|  TAMANHO  |---|  CUPUAÇU (CP)  |---|  AÇAÍ (AC)  |---')
print('---|     P     |---|    R$  9.90    |---|  R$ 11.00   |---')
print('---|     M     |---|    R$ 14.00    |---|  R$ 16.00   |---')
print('---|     G     |---|    R$ 18.00    |---|  R$ 20.00   |---')
print('----------------------------------------------------------')

cardapio = {
    "cp": {"P": 9.00, "M": 14.00, "G": 18.00},
    "ac": {"P": 11.00, "M": 16.00, "G": 20.00}
}

sabores_validos = ["cp", "ac"]
tamanhos_validos = ["P", "M", "G"]

pedido_total = 0